# 編寫一個名為「mySort」的函數
# 該函數將整數列表作為輸入，並傳回輸入列表的排序版本。您不能使用內建的sorted()函數。
# bubble sort(氣泡排序法)寫法
# ['1', '4', '3', '6', '5', '2']
def mySort(input_list):
    num_list = input_list.copy()
    # 從index為0開始
    for index1 in range(len(num_list)):
        # index2為num_list的0+index1開始，因為index1前面是已經排序好的(從最小依序排好的)
        print(f'此圈進行排序的index為【{0+index1}】')
        # 從index1與後面的index開始比較
        for loop2_counter,index2 in enumerate(range(1+index1,len(num_list))):
            print(f'當前列表為{num_list}')
            print(f'這是loop1的第【{index1}】圈的loop2第【{loop2_counter}】圈，index1為【{index1}】，index2為【{index2}】')
            print(f'當前列表index1的值為:【{num_list[index1]}】，index2的值為:【{num_list[index2]}】')
            # 如果num_list的第index1大於num_list的第index2
            # 若是交換了，那下一次的index2迴圈的num_list[index2]依然會是這次num_list[index1]的值
            # 這樣就能繼續跟後面的index的值做比大小交換
            if(num_list[index1]>num_list[index2]):
                print(f'!!!index1的值【{num_list[index1]}】大於index2的值【{num_list[index2]}】!!!')
                print(f'交換前的list為{num_list}')
                # 那就將num_list的第index1與第index2交換
                num_list[index1],num_list[index2] = num_list[index2],num_list[index1]
                print(f'交換後的list為{num_list}')
            else:
                print(f'index1的值【{num_list[index1]}】沒有大於index2的值【{num_list[index2]}】所以不交換')
            print(f'loop1的第【{index1}】圈的loop2第【{loop2_counter}】圈結束')
            print("----------------------------------------------------------------------")
        print(f'loop1的第【{index1}】圈結束')
        print(f'第【{index1}】小的值為{num_list[index1]}')
        print("++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++")
    return num_list

input_num_list = input("請輸入所有數字，以空格分開:").split(" ")
sorted_list = mySort(input_num_list)
print(f'輸入的list:{input_num_list}，排序後為:{sorted_list}')

# 請輸入所有數字，以空格分開:1 4 3 6 5 2
# 此圈進行排序的index為【0】
# 當前列表為['1', '4', '3', '6', '5', '2']
# 這是loop1的第【0】圈的loop2第【0】圈，index1為【0】，index2為【1】
# 當前列表index1的值為:【1】，index2的值為:【4】
# index1的值【1】沒有大於index2的值【4】所以不交換
# loop1的第【0】圈的loop2第【0】圈結束
# ----------------------------------------------------------------------
# 當前列表為['1', '4', '3', '6', '5', '2']
# 這是loop1的第【0】圈的loop2第【1】圈，index1為【0】，index2為【2】
# 當前列表index1的值為:【1】，index2的值為:【3】
# index1的值【1】沒有大於index2的值【3】所以不交換
# loop1的第【0】圈的loop2第【1】圈結束
# ----------------------------------------------------------------------
# 當前列表為['1', '4', '3', '6', '5', '2']
# 這是loop1的第【0】圈的loop2第【2】圈，index1為【0】，index2為【3】
# 當前列表index1的值為:【1】，index2的值為:【6】
# index1的值【1】沒有大於index2的值【6】所以不交換
# loop1的第【0】圈的loop2第【2】圈結束
# ----------------------------------------------------------------------
# 當前列表為['1', '4', '3', '6', '5', '2']
# 這是loop1的第【0】圈的loop2第【3】圈，index1為【0】，index2為【4】
# 當前列表index1的值為:【1】，index2的值為:【5】
# index1的值【1】沒有大於index2的值【5】所以不交換
# loop1的第【0】圈的loop2第【3】圈結束
# ----------------------------------------------------------------------
# 當前列表為['1', '4', '3', '6', '5', '2']
# 這是loop1的第【0】圈的loop2第【4】圈，index1為【0】，index2為【5】
# 當前列表index1的值為:【1】，index2的值為:【2】
# index1的值【1】沒有大於index2的值【2】所以不交換
# loop1的第【0】圈的loop2第【4】圈結束
# ----------------------------------------------------------------------
# loop1的第【0】圈結束
# 第【0】小的值為1
# ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
# 此圈進行排序的index為【1】
# 當前列表為['1', '4', '3', '6', '5', '2']
# 這是loop1的第【1】圈的loop2第【0】圈，index1為【1】，index2為【2】
# 當前列表index1的值為:【4】，index2的值為:【3】
# !!!index1的值【4】大於index2的值【3】!!!
# 交換前的list為['1', '4', '3', '6', '5', '2']
# 交換後的list為['1', '3', '4', '6', '5', '2']
# loop1的第【1】圈的loop2第【0】圈結束
# ----------------------------------------------------------------------
# 當前列表為['1', '3', '4', '6', '5', '2']
# 這是loop1的第【1】圈的loop2第【1】圈，index1為【1】，index2為【3】
# 當前列表index1的值為:【3】，index2的值為:【6】
# index1的值【3】沒有大於index2的值【6】所以不交換
# loop1的第【1】圈的loop2第【1】圈結束
# ----------------------------------------------------------------------
# 當前列表為['1', '3', '4', '6', '5', '2']
# 這是loop1的第【1】圈的loop2第【2】圈，index1為【1】，index2為【4】
# 當前列表index1的值為:【3】，index2的值為:【5】
# index1的值【3】沒有大於index2的值【5】所以不交換
# loop1的第【1】圈的loop2第【2】圈結束
# ----------------------------------------------------------------------
# 當前列表為['1', '3', '4', '6', '5', '2']
# 這是loop1的第【1】圈的loop2第【3】圈，index1為【1】，index2為【5】
# 當前列表index1的值為:【3】，index2的值為:【2】
# !!!index1的值【3】大於index2的值【2】!!!
# 交換前的list為['1', '3', '4', '6', '5', '2']
# 交換後的list為['1', '2', '4', '6', '5', '3']
# loop1的第【1】圈的loop2第【3】圈結束
# ----------------------------------------------------------------------
# loop1的第【1】圈結束
# 第【1】小的值為2
# ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
# 此圈進行排序的index為【2】
# 當前列表為['1', '2', '4', '6', '5', '3']
# 這是loop1的第【2】圈的loop2第【0】圈，index1為【2】，index2為【3】
# 當前列表index1的值為:【4】，index2的值為:【6】
# index1的值【4】沒有大於index2的值【6】所以不交換
# loop1的第【2】圈的loop2第【0】圈結束
# ----------------------------------------------------------------------
# 當前列表為['1', '2', '4', '6', '5', '3']
# 這是loop1的第【2】圈的loop2第【1】圈，index1為【2】，index2為【4】
# 當前列表index1的值為:【4】，index2的值為:【5】
# index1的值【4】沒有大於index2的值【5】所以不交換
# loop1的第【2】圈的loop2第【1】圈結束
# ----------------------------------------------------------------------
# 當前列表為['1', '2', '4', '6', '5', '3']
# 這是loop1的第【2】圈的loop2第【2】圈，index1為【2】，index2為【5】
# 當前列表index1的值為:【4】，index2的值為:【3】
# !!!index1的值【4】大於index2的值【3】!!!
# 交換前的list為['1', '2', '4', '6', '5', '3']
# 交換後的list為['1', '2', '3', '6', '5', '4']
# loop1的第【2】圈的loop2第【2】圈結束
# ----------------------------------------------------------------------
# loop1的第【2】圈結束
# 第【2】小的值為3
# ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
# 此圈進行排序的index為【3】
# 當前列表為['1', '2', '3', '6', '5', '4']
# 這是loop1的第【3】圈的loop2第【0】圈，index1為【3】，index2為【4】
# 當前列表index1的值為:【6】，index2的值為:【5】
# !!!index1的值【6】大於index2的值【5】!!!
# 交換前的list為['1', '2', '3', '6', '5', '4']
# 交換後的list為['1', '2', '3', '5', '6', '4']
# loop1的第【3】圈的loop2第【0】圈結束
# ----------------------------------------------------------------------
# 當前列表為['1', '2', '3', '5', '6', '4']
# 這是loop1的第【3】圈的loop2第【1】圈，index1為【3】，index2為【5】
# 當前列表index1的值為:【5】，index2的值為:【4】
# !!!index1的值【5】大於index2的值【4】!!!
# 交換前的list為['1', '2', '3', '5', '6', '4']
# 交換後的list為['1', '2', '3', '4', '6', '5']
# loop1的第【3】圈的loop2第【1】圈結束
# ----------------------------------------------------------------------
# loop1的第【3】圈結束
# 第【3】小的值為4
# ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
# 此圈進行排序的index為【4】
# 當前列表為['1', '2', '3', '4', '6', '5']
# 這是loop1的第【4】圈的loop2第【0】圈，index1為【4】，index2為【5】
# 當前列表index1的值為:【6】，index2的值為:【5】
# !!!index1的值【6】大於index2的值【5】!!!
# 交換前的list為['1', '2', '3', '4', '6', '5']
# 交換後的list為['1', '2', '3', '4', '5', '6']
# loop1的第【4】圈的loop2第【0】圈結束
# ----------------------------------------------------------------------
# loop1的第【4】圈結束
# 第【4】小的值為5
# ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
# 此圈進行排序的index為【5】
# loop1的第【5】圈結束
# 第【5】小的值為6
# ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
# 輸入的list:['1', '4', '3', '6', '5', '2']，排序後為:['1', '2', '3', '4', '5', '6']